{"modelTopology":{"shape_name":"gaussians","iter_count":1931,"config":{"selectedNoiseType":"2D Gaussian","noiseSize":2,"numGeneratorLayers":1,"numDiscriminatorLayers":1,"numGeneratorNeurons":8,"numDiscriminatorNeurons":8,"dLearningRate":0.1,"gLearningRate":0.03,"dOptimizerType":"SGD","gOptimizerType":"SGD","lossType":"Log loss","kDSteps":2,"kGSteps":1}},"weightsManifest":[{"paths":["./pretrained_gaussians.weights.bin"],"weights":[{"name":"d-0","shape":[2,8],"dtype":"float32"},{"name":"d-1","shape":[8],"dtype":"float32"},{"name":"d-2","shape":[8,8],"dtype":"float32"},{"name":"d-3","shape":[8],"dtype":"float32"},{"name":"d-4","shape":[8,1],"dtype":"float32"},{"name":"d-5","shape":[1],"dtype":"float32"},{"name":"g-0","shape":[2,8],"dtype":"float32"},{"name":"g-1","shape":[8],"dtype":"float32"},{"name":"g-2","shape":[8,8],"dtype":"float32"},{"name":"g-3","shape":[8],"dtype":"float32"},{"name":"g-4","shape":[8,2],"dtype":"float32"},{"name":"g-5","shape":[2],"dtype":"float32"}]}]}