{"modelTopology":{"shape_name":"Ring","iter_count":812,"config":{"selectedNoiseType":"2D Uniform","noiseSize":2,"numGeneratorLayers":1,"numDiscriminatorLayers":2,"numGeneratorNeurons":10,"numDiscriminatorNeurons":9,"dLearningRate":0.1,"gLearningRate":0.03,"dOptimizerType":"SGD","gOptimizerType":"SGD","lossType":"Log loss","kDSteps":3,"kGSteps":1}},"weightsManifest":[{"paths":["../pretrained_models/pretrained_ring.weights.bin"],"weights":[{"name":"d-0","shape":[2,9],"dtype":"float32"},{"name":"d-1","shape":[9],"dtype":"float32"},{"name":"d-2","shape":[9,9],"dtype":"float32"},{"name":"d-3","shape":[9],"dtype":"float32"},{"name":"d-4","shape":[9,9],"dtype":"float32"},{"name":"d-5","shape":[9],"dtype":"float32"},{"name":"d-6","shape":[9,1],"dtype":"float32"},{"name":"d-7","shape":[1],"dtype":"float32"},{"name":"g-0","shape":[2,10],"dtype":"float32"},{"name":"g-1","shape":[10],"dtype":"float32"},{"name":"g-2","shape":[10,10],"dtype":"float32"},{"name":"g-3","shape":[10],"dtype":"float32"},{"name":"g-4","shape":[10,2],"dtype":"float32"},{"name":"g-5","shape":[2],"dtype":"float32"}]}]}