{"modelTopology":{"shape_name":"line","iter_count":466,"config":{"selectedNoiseType":"2D Uniform","noiseSize":2,"numGeneratorLayers":1,"numDiscriminatorLayers":1,"numGeneratorNeurons":5,"numDiscriminatorNeurons":6,"dLearningRate":0.03,"gLearningRate":0.01,"dOptimizerType":"SGD","gOptimizerType":"SGD","lossType":"Log loss","kDSteps":2,"kGSteps":1}},"weightsManifest":[{"paths":["./pretrained_line.weights.bin"],"weights":[{"name":"d-0","shape":[2,6],"dtype":"float32"},{"name":"d-1","shape":[6],"dtype":"float32"},{"name":"d-2","shape":[6,6],"dtype":"float32"},{"name":"d-3","shape":[6],"dtype":"float32"},{"name":"d-4","shape":[6,1],"dtype":"float32"},{"name":"d-5","shape":[1],"dtype":"float32"},{"name":"g-0","shape":[2,5],"dtype":"float32"},{"name":"g-1","shape":[5],"dtype":"float32"},{"name":"g-2","shape":[5,5],"dtype":"float32"},{"name":"g-3","shape":[5],"dtype":"float32"},{"name":"g-4","shape":[5,2],"dtype":"float32"},{"name":"g-5","shape":[2],"dtype":"float32"}]}]}