{"modelTopology":{"shape_name":"disjoint","iter_count":1710,"config":{"selectedNoiseType":"2D Gaussian","noiseSize":2,"numGeneratorLayers":2,"numDiscriminatorLayers":2,"numGeneratorNeurons":10,"numDiscriminatorNeurons":11,"dLearningRate":0.1,"gLearningRate":0.03,"dOptimizerType":"SGD","gOptimizerType":"SGD","lossType":"Log loss","kDSteps":1,"kGSteps":1}},"weightsManifest":[{"paths":["./pretrained_disjoint.weights.bin"],"weights":[{"name":"d-0","shape":[2,11],"dtype":"float32"},{"name":"d-1","shape":[11],"dtype":"float32"},{"name":"d-2","shape":[11,11],"dtype":"float32"},{"name":"d-3","shape":[11],"dtype":"float32"},{"name":"d-4","shape":[11,11],"dtype":"float32"},{"name":"d-5","shape":[11],"dtype":"float32"},{"name":"d-6","shape":[11,1],"dtype":"float32"},{"name":"d-7","shape":[1],"dtype":"float32"},{"name":"g-0","shape":[2,10],"dtype":"float32"},{"name":"g-1","shape":[10],"dtype":"float32"},{"name":"g-2","shape":[10,10],"dtype":"float32"},{"name":"g-3","shape":[10],"dtype":"float32"},{"name":"g-4","shape":[10,10],"dtype":"float32"},{"name":"g-5","shape":[10],"dtype":"float32"},{"name":"g-6","shape":[10,2],"dtype":"float32"},{"name":"g-7","shape":[2],"dtype":"float32"}]}]}